openfoam_runs/run_0021/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  Moth hull - background mesh
  Domain (metres): x[-1,5] y[-1.5,1.5] z[-0.8,0]
  x=0 = bow, x=3.355 = stern, z=0 = waterline (slip / free surface)
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-1.0  -1.5  -0.8)   // 0
    ( 5.0  -1.5  -0.8)   // 1
    ( 5.0   1.5  -0.8)   // 2
    (-1.0   1.5  -0.8)   // 3
    (-1.0  -1.5   0.0)   // 4
    ( 5.0  -1.5   0.0)   // 5
    ( 5.0   1.5   0.0)   // 6
    (-1.0   1.5   0.0)   // 7
);

blocks
(
    // (nX nY nZ) — coarse background; snappyHexMesh refines near hull
    hex (0 1 2 3 4 5 6 7) (36 18 6) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces ( (0 4 7 3) );
    }
    outlet
    {
        type patch;
        faces ( (1 2 6 5) );
    }
    front
    {
        type wall;
        faces ( (0 1 5 4) );
    }
    back
    {
        type wall;
        faces ( (2 3 7 6) );
    }
    bottom
    {
        type wall;
        faces ( (0 3 2 1) );
    }
    top
    {
        // Free-surface approximation: slip wall at z=0
        type symmetryPlane;
        faces ( (4 5 6 7) );
    }
);
